# Здесь хранятся тексты

commands = """
🧾 Команды:

/requirements - Узнать, что мы ждём от Вас

/info - Информация о нас

/work - Подать простую заявку на вступление в команду

/suggestion - Предложение по улучшению/идея"""

need = """
🔍 Сейчас мы ищем любых программистов, готовых нам помочь своей усердной работой.

Что нам нужно от Вас:
0 - Желание узнавать что-то новое и работать в команде.

1 - Знать, как устроен Интернет.

2 - Знать, как устроен HTTP.

3 - Наши основные языки: Rust, Kotlin, Python, JS, SQL.

4 - Знать, как устроена работа компьютера (Computer Science).

5 - Знать, как устроена сеть (DHCP, DNS, Routers, Server, Client, IP, TCP, UPD, SMTP, Ports, Subnetting etc.)

*Не страшно, если Вы всего не знаете. Все мы были такими."""

channel = "ℹ️ Канал: @devs_ch"

chat = "ℹ️ Чат: @devs_group_chat"

info = """
ℹ️ Мы открытая, Open Source, не профитная команда заинтересованных разработчиков.

Подробнее: https://telegra.ph/Nashe-soobshchestvo-02-15"""

contact = """
ℹ️ Связаться с основателем: @sqr3m
Не пишите метавопросами (\"как дела?\", \"что делаешь?\"). 
"""

work = """
📝 Нам очень интересно узнать о Вас.
Просим заполнить Вас анкету в таком стиле:

1. Имя (Ф. О. по желанию)
2. Какими навыками владеете? 
3. Чем хотите заниматься у нас у нас? (Дизайн/Программирование, пр.)
4. Есть ли GitHub/GitLab?
5. Как у Вас с общением? (Общительный, необщительный)
6. Ваш @ ник для связи
"""

work_anket_example = """
ПРИМЕР:

/anket
Иванов Иван
Программирование, дизайн, анимация
Работа над протоколом
*Ссылка на профиль GitHub/GitLab*
Общительный, иногда матерюсь :)
@red_parrot_bot
"""

suggestion = """
💡 Кажется, тебе есть что предложить.

Сформируй анкету так:
1. Сама идея
2. Подробное описание
3. Свой @ ник для связи. Его можно выставить в Настройки - Имя пользователя.
"""

suggest_anket_example = """
ПРИМЕР:

/suggest
Скорость приложения
Я знаю, как можно увеличить скорость приложения. Нужно всего лишь...
@red_parrot_bot"""